Netology1/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology1/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Netology1/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Netology1/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Netology1/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.Продажи.Очистить();
	Движения.Продажи.Записать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	ТаблицаДляПроведения = Товары.Выгрузить();
	ТаблицаДляПроведения.Свернуть("Номенклатура", "Количество, Сумма");
	
	ТипТовар = Перечисления.ТипНоменклатуры.Товар;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаДляПроведения Цикл
		
		Если ТекСтрокаТовары.Номенклатура.ТипНоменклатуры = ТипТовар Тогда 
			
			ОтборПоТовару = Новый Структура("Номенклатура", ТекСтрокаТовары.Номенклатура);
			Остатки = РегистрыНакопления.Товары.Остатки(Дата, ОтборПоТовару);
			
			Если Остатки.Количество() = 0 Тогда
				ТекстСообщения = СтрШаблон("Товара %1 нет на складе", ТекСтрокаТовары.Номенклатура);
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			СтрокаОстатка = Остатки[0];
			Если СтрокаОстатка.Количество < ТекСтрокаТовары.Количество Тогда
				НедостатокТовара = ТекСтрокаТовары.Количество - СтрокаОстатка.Количество;
				ТекстСообщения = СтрШаблон("Товара %1 недостаточно на складе, не хватает %2", ТекСтрокаТовары.Номенклатура, НедостатокТовара);
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если СтрокаОстатка.Количество = ТекСтрокаТовары.Количество Тогда
				СуммаКСписанию = СтрокаОстатка.Сумма;
			Иначе
				СебестоимостьЕдиницыТовара = СтрокаОстатка.Сумма / СтрокаОстатка.Количество;
				СуммаКСписанию = СебестоимостьЕдиницыТовара * ТекСтрокаТовары.Количество;
			КонецЕсли; 
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = СуммаКСписанию;
		КонецЕсли;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Ответственный;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;

КонецПроцедуры
